One or more Profile Loops are invalid, probably because of self-intersection.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BadRailProfile { get; }
  Visual Basic
Public Shared ReadOnly Property BadRailProfile As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BadRailProfile {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace